* [[https://class.coursera.org/logic1-002/lecture][Logic: Language and Information 1]]

** [[http://www.inf.ed.ac.uk/teaching/courses/lp/][Logic Programming Fall term 2014 ]]
** [[https://d396qusza40orc.cloudfront.net/logic1%2Fnotes%2Flogic1notes.pdf][logic Language & Information volume 1]]

** 0: Preliminaries
*** DONE Welcome (8:47)
    CLOSED: [2015-02-27 Fri 08:22]


** 1: Language and Models of Propositional Logic (Core)
*** DONE 1.1.1 Propositions (5:17)
    CLOSED: [2015-02-28 Sat 06:06]
*** DONE 1.1.2 Connectives (19:44)
    CLOSED: [2015-02-03 Tue 06:46] SCHEDULED: <2015-03-02 Mon>
    + Connectives (կապեր)
      1. Conjuction
         - p & q
         - p and q
      2. or - inclusive Disjunction v (vel in Latin)
         - p v q
         - inclusive "I'll get wet, or I'm lucky (and maybe both)'
         - exclusive "I'll get wet, or I'm lucky (and not both)"
      3. Negation
         if p is propostion, its negation is ~p
         p is said to be the negand of ~p
         - ~p
         - !p
         - not p
      4. Conditionals
         We say p is the antecedent, and q is the consequent
         - if p then q
         - if p, q
         - q if p
         - p only if q
         - p implies q (ենթադրել)
      5. unless
      6. biconditional if-only-if (iff) p=q
         p and q are the left-and right-hand expressions of the biconditional
      7. that
      8. because

*** DONE 1.1.3 Propositional Formulas (9:23)
    CLOSED: [2015-03-03 Tue 07:21] SCHEDULED: <2015-03-03 Tue>
    Formulas := {Atoms | Formulas}
*** DONE 1.1.4 Formalisation (7:00)
    CLOSED: [2015-03-04 Wed 06:14] SCHEDULED: <2015-03-04 Wed>
    Տեքստը ֆորմալ լեզվով ներկայացնելը, այսինքն թարգմանելը ասույթների լեզվին, կանվանենք ֆորմալիզացիա:
    Ֆորմալիզացիայի համար 
     - Գտնենք կապերը
     - Ստեղծել բառարան
     - Գտնել ձևերը

*** DONE 1.1.5 Expressive power (8:40)
    CLOSED: [2015-03-04 Wed 06:22] SCHEDULED: <2015-03-04 Wed>
*** DONE 1.2.1 Setting Up Truth Tables (6:35)
    CLOSED: [2015-03-05 Thu 07:19] SCHEDULED: <2015-03-05 Thu>
    Ասույթների լեզվի սեմանտիկան: Ասույթներ կարող են լինել «ճիշտ» կամ «սխալ» մեկ այլ նշանակւոմով 1 կամ 0
    Հավանանային տրամաբանության մեջ արժեքների տիրույթը ամբողջ [0,1] հատվաղն է:
*** DONE 1.2.2 Negation, Conjunction and Disjunction (10:37)
    CLOSED: [2015-03-05 Thu 07:55] SCHEDULED: <2015-03-05 Thu>
    - Տրամաբանական կապերի ճշմարտության աղյուսակները
      - Ժխտմանը
        Եթե ունենք Ա ասույթ, ապա ~Ա բանաձևի ճշմարտության աղյուսակը, որը 
        ցույց է տալիս ~Ա բանաձևի «ճիշտ» կամ «սխալ» լինելը կախված Ա ասույթի 
        «ճիշտ» կամ «սխալ» լինելուց, հետևյալն է՝

        | A | ~A |
        |---+----|
        | 0 |  1 |
        | 1 |  0 |
        |---+----|

      - տրամաբանական և կամ Կոնյուկցիա
        կոմուտատիվ է
        
        | A | B | (A & B) |
        |---+---+---------|
        | 0 | 0 |       0 |
        | 0 | 1 |       0 |
        | 1 | 0 |       0 |
        | 1 | 1 |       1 |
        |---+---+---------|

      - տրամաբանական կամ կամ Դիսյուկցիա
        դուալ է կոնյուկցիայի նկատմամբ
        կոմուտատիվ է


        | A | B | (A v B) |
        |---+---+---------|
        | 0 | 0 |       0 |
        | 0 | 1 |       1 |
        | 1 | 0 |       1 |
        | 1 | 1 |       1 |
        |---+---+---------|

      - Բարդ բանաձևի օրինակ

        | p | q | ~ (~ p & ~ q) | (p v q) |
        |---+---+---------------+---------|
        | 0 | 0 | 0  1 0 1 1 0  |    0    |
        | 0 | 1 | 1  1 0 0 0 1  |    1    |
        | 1 | 0 | 1  0 1 0 1 0  |    1    |
        | 1 | 1 | 1  0 1 0 0 1  |    1    |
        |---+---+---------------+---------|
        |   |   | 3  1 0 2 1 0  |         |

      - 
     
*** DONE 1.2.3 The Material Conditional & Biconditional (11:50)
    CLOSED: [2015-03-06 Fri 06:28] SCHEDULED: <2015-03-06 Fri>
    - տրամաբանական հետևություն
        
        | A | B | (A -> B) |
        |---+---+----------|
        | 0 | 0 |        1 |
        | 0 | 1 |        1 |
        | 1 | 0 |        0 |
        | 1 | 1 |        1 |
        |---+---+----------|

        (A->B) համարժեք է ~(A & ~B)

    - տրամաբանական նույնություն
        
        | A | B | (A = B)  |
        |---+---+----------|
        | 0 | 0 |        1 |
        | 0 | 1 |        0 |
        | 1 | 0 |        0 |
        | 1 | 1 |        1 |
        |---+---+----------|
      (A=b) համարժեք է (A->B)&(B->A)



*** DONE 1.3.1 Classifying Propositions (11:18)
    CLOSED: [2015-03-07 Sat 07:20] SCHEDULED: <2015-03-07 Sat>
    1. Տավտալոգիա (tautology)
      Ա ասույթային բանաձևը կանվանենք տավտոլոգիա, եթե միշտ ընդունում է 1 արժեքը
       - Օրինակ. 
         * (p V ~p),
         * (pVq)=~(~p&~q) (p&q)=~(~pV~q) (de Morgan's lows)
         * ((p->q)&~q)->~p (Modus tollens)
         * (p->q)=(~q->~p) ()

    2. Հակասություն (Contradiction) 
       ասույթային բանաձևը կանվանենք տավտոլոգիա, եթե միշտ ընդունում է 0 արժեքը
       - Օրինակ. 
         * (p & ~p),
         * (p->q)&(p->~q)
         * 
    3. Կատարելի (satisfiable)
       ունի առնվազմն մեկ հատ 1 իր ճշմարտության աղյուսակում
    4. Դիպվածային (contingent)
       Եթե Կատարելի է բայգ տավտոլոգիա չէ
    5. ասույթային բանաձևը տավտոլոգիա է 
       - միայն ու միայն այն դեպում եթե ~A is not satisfiable
       - միայն ու միայն այն դեպում եթե ~A is a contradiction

*** DONE 1.3.2 Relationships Between Propositions (14:26)
    CLOSED: [2015-03-08 Sun 08:52] SCHEDULED: <2015-03-08 Sun>
    Հարաբերություններ ասույթների միջև
    1. Տրամաբանական հետևություն (consequence)
       կասենք Բ բանաձևը Ա բանաձևի տրամաբանական հետևություն է, եթե 
       այն տողերում որտեղ Ա բանաձը ճիշտ է Բ էլ է ճիշտ:
       A |= B
       A logical implies B - ենթադրել
       A logical entails B - հանգեցնել 
      
       Օրինակ. p & ~q |= ~p V ~q, քանի որ
    
       | p | q | p & ~q | ~p V ~q |
       |---+---+--------+---------|
       | 0 | 0 |      0 |       1 |    
       | 0 | 1 |      0 |       1 |
       | 1 | 0 |      1 |       1 |         
       | 1 | 1 |      0 |       0 |
       |---+---+--------+---------|

    2. Տրամաբանական նույնություն (equivalence)
       կասենք Ա բանաձևը տրամաբանորեն նույնական է  Բ բանաձևին, 
       եթե բոլոր տողերում Ա և Բ բանաձևերը ընդունում են նույն արժեքները:
       A =|= B
       Թերորեմ: կամայական A և B ասույթային բանաձևեր հարաբերվում են որպես.
       1) տրամաբանական նույնություններ A =|= B 
          * միայն ու միայն այն դեպքում, երբ  A|= B և  B |= A:
          * միայն ու միայն այն դեպքում, երբ  (A = B) տավտալոգիա է
       2) տրամաբանական հետևություն A |= B
          միայն ու միայն այն դեպքում, երբ  (A -> B) տավտալոգիա է
    3. Տրամաբանական հակասություն (contradictories)
       կասենք Ա բանաձևը տրամաբանորեն հակասական է  Բ բանաձևին, 
       եթե բոլոր տողերում Ա և Բ բանաձևերը ընդունում են հակադիր արժեքներ:
       A =|= B
       Թերորեմ: կամայական A և B ասույթային բանաձևեր տրամաբանական հակասական են, եթտ
       * միայն ու միայն այն դեպքում, երբ  A =|= ~B
       * միայն ու միայն այն դեպքում, երբ  (A = ~B) տավտալոգիա է
    4. Տրադիցիոն տրամաբանանակն հարաբերություններ
       1) հակասություն contraries
          Ա և Բ բանաձևերը հակասական են, եթե նրանք երկուսն էլ չեն կարող լինել ճշմարիտ՝
          Բ սխալ է այն տողերում երբ Ա ճիշտ է, և Ա սխալ է երբ Բ ճիշտ է:
          ~(pvq) p&q, these formulas are contraries but does not sub-contraries.
          Թերորեմ: կամայական A և B ասույթային բանաձևեր հակասություններ են, եթե
          * միայն ու միայն այն դեպքում, երբ  A |= ~B
          * միայն ու միայն այն դեպքում, երբ  (A -> ~B) տավտալոգիա է

       2) ենթահակասություն sub-contraries
          Ա և Բ բանաձևերը ենթա-հակասական են, եթե նրանք երկուսն էլ չեն կարող լինել սխալ՝
          Բ ճիշտ է այն տողերում երբ Ա սխալ է, և Ա ճիշտ է երբ Բ սխալ է:
          Թերորեմ: կամայական A և B ասույթային բանաձևեր ենթա- հակասություններ են, եթե
          * միայն ու միայն այն դեպքում, երբ  ~A |= B
          * միայն ու միայն այն դեպքում, երբ  (~A -> B) տավտալոգիա է
         
*** DONE Graded Quiz 1a: The Propositional Language
    CLOSED: [2015-03-06 Fri 06:45] SCHEDULED: <2015-03-06 Fri>
*** DONE Graded Quiz 1b: Models of Propositional Logic
    CLOSED: [2015-03-07 Sat 07:28] SCHEDULED: <2015-03-07 Sat>
*** DONE Practice Quiz: 1a The Propositional Language
    CLOSED: [2015-03-09 Mon 19:30] SCHEDULED: <2015-03-08 Sun>
*** DONE Practice Quiz: 1b Models of Propositional Logic
    SCHEDULED: <2015-03-07 Sat>
*** Practice Quiz: 2a Using Truth Tables to Check for Logical Relations and Validity 
*** Practice Quiz: 2b Trees for Propositional Logic

** 2: Proofs for Propositional Logic (Core)
*** DONE 2.1.1 Validity of Arguments (9:38)
    CLOSED: [2015-03-09 Mon 10:54] SCHEDULED: <2015-03-09 Mon>
    պնդումների վավերականության մասին:
    ճշմարության աղյուսակների միջոցով վավերականության ստուգումը

    - պնդումը կապում է նախադրյալները(premises) եզրահանգմանը: Կան լավ և ոչ այնքան լավ պնդումներ:
      Տրամաբաններին հետաքրքրում է ինչով է պայմանավորված տարբերությունը:
    - պնդում վավերական է եթե բոլոր նախադրյալները ճիշտ են ապա եզրահանգումը նույնպես ճիշտ է:
      Պնդում որոնք պարունկաում է A1, A2, ..., An նախադրյլանե և B եզրահանգումշ մենք կգրենք
      A1, A2, ..., An |= B , եթե 
      պնդումը որ A1, A2, ..., An հետևում է B վավերական է: arguemnt from premisies to conclusion B is valid.
    - օրինակ.
     A1 = (p&~q)->r
     A2 = ~r
     B = p->q
     ---------
      պետք է ստուգենք A1, A2 |= B պնդման վավերականությունը

      | # | p | q | r | (p&~q)->r | ~r | p -> q |   |
      |---+---+---+---+-----------+----+--------+---|
      | 1 | 0 | 0 | 0 |         1 |  1 |      1 | + |
      | 2 | 0 | 0 | 1 |         1 |  0 |      1 |   |
      | 3 | 0 | 1 | 0 |         1 |  1 |      1 | + |
      | 4 | 0 | 1 | 1 |         1 |  0 |      1 |   |
      | 5 | 1 | 0 | 0 |         0 |  1 |      0 |   |
      | 6 | 1 | 0 | 1 |         1 |  0 |      0 |   |
      | 7 | 1 | 1 | 0 |         1 |  1 |      1 | + |
      | 8 | 1 | 1 | 1 |         1 |  0 |      1 |   |
      |---+---+---+---+-----------+----+--------+---|
      #+TBLFM: $1=vlen(@I$1..0);EN

      վավերականություն հաստատելու համար պետք է նաենք այն տողերը որտեղ 
      A1 և A2 նախադրյալները ընդունում են ճշմարիտ արժեք. 1-ին, 3-րդ և 7-րդ տողերը
      և համոզվենք որ համապատասխան տողերում եզրահանգումը նույնպես ընդունում է 
      ճշմարիտ արժեք, հետևաբար վավերական է մեր պնդումը:





**** Վարհանգման թեորեմ Deduction theorem (semantic form)
     տրամաբանական հետևության և տավտոլոգիայի հարաբերությունից կարող են տալ 
     համապատասխան հարաբերություն պնդման վավերականության և տավտոլոգիայի միջև:
     Թեորեմ. պնդումը A1, A2, ..., An նախադրյալներից դեպի եզրահանգումը վավերական է, այսինքն
     A1, A2, ..., An |= B , միայն ու միայն այն դեպքում  (iff)
     (A1 & A2 & ... & An) -> B տավտոլոգիա է, այսինքն
     (A1 & A2 & ... & An) |= B
     Σ A |= B iff Σ |= A->B

           

*** TODO 2.1.2 Argument Forms, Instances and Soundness (16:42)
    SCHEDULED: <2015-03-10 Tue>
*** TODO 2.2.1 Why We Need Proof Trees (15:12)
    SCHEDULED: <2015-03-12 Thu>
*** TODO 2.2.2 Rules for Proof Trees for Propositional Logic (9:07)
    SCHEDULED: <2015-03-14 Sat>
*** 2.2.3 Example Proof Trees for Propositional Logic (14:35)
*** 2.2.4 Why Trees and Truth Tables Agree (14:02)
*** TODO Practice Quiz: 2a Using Truth Tables to Check for Logical Relations and Validity (5 marks)
    SCHEDULED: <2015-03-10 Tue>
*** Practice Quiz: 2b Trees for Propositional Logic (15 marks) 
